 # 'brew tap'
tap "hashicorp/tap"
tap "cloudflare/cloudflare"
tap "homebrew/cask-fonts"

# Core
brew "direnv"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "git"
brew "go"
brew "hugo"
brew "jq"
brew "libpq"
brew "m1ddc"
brew "neovim"
brew "nnn"
brew "ripgrep"
brew "starship"
brew "tree"
brew "z.lua"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Misc.
brew "nvm"
brew "pre-commit"
brew "structurizr-cli"
brew "trivy"

# Cloud
brew "awscli"
brew "circleci"
brew "flyctl"

# Kubernetes
brew "argocd"
brew "chart-testing"
brew "helm"
brew "k3d"
brew "k9s"
brew "kor"
brew "krew"
brew "kubeconform"
brew "yaml-language-server"
brew "yamllint"
brew "yq"

# Terraform
brew "cloudflare/cloudflare/cf-terraforming"
brew "hashicorp/tap/terraform"
brew "terraform-docs"
brew "terraform-ls"

# Ruby
brew "chruby"
brew "ruby-build"
brew "watchman" # used by Sorbet for Ruby
