tap "homebrew/bundle"
tap "homebrew/services"

# Core
brew "direnv"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "git"
brew "hugo"
brew "jq"
brew "neovim"
brew "nnn"
brew "ripgrep"
brew "syncthing"
brew "starship"
brew "tree"
brew "watchman" # for React Native
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Misc.
brew "pre-commit"

# Languages
brew "asdf"
brew "pnpm"
brew "go"

brew "gopls"
brew "lua-language-server"
brew "ruby-lsp"
brew "typescript-language-server"
