 # 'brew tap'
tap "hashicorp/tap"
tap "cloudflare/cloudflare"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Core
brew "direnv"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "git"
brew "go"
brew "hugo"
brew "jq"
brew "libpq"
brew "m1ddc"
brew "neovim"
brew "nnn"
brew "ripgrep"
brew "syncthing"
brew "starship"
brew "tree"
brew "z.lua"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# LSP
brew "lua-language-server"
brew "yaml-language-server"
brew "terraform-ls"
brew "helm-ls"
brew "gopls"


# Misc.
brew "nvm"
brew "pre-commit"
brew "structurizr-cli"
brew "trivy"

# Cloud
brew "awscli"
brew "circleci"
brew "flyctl"

# Kubernetes
brew "argocd"
brew "chart-testing"
brew "helm"
brew "k3d"
brew "k9s"
brew "kor"
brew "krew"
brew "kubeconform"
brew "yamllint"
brew "yq"

# Terraform
brew "cloudflare/cloudflare/cf-terraforming"
brew "hashicorp/tap/terraform"
brew "terraform-docs"

# Ruby
brew "chruby"
brew "ruby-build"

# Cask
cask "1password"
cask "docker"
cask "font-fantasque-sans-mono-nerd-font"
cask "kitty"
cask "obs"
cask "obsidian"
cask "raindropio"
cask "raycast"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "zed"

# VSCode
## General
vscode "Catppuccin.catppuccin-vsc"
vscode "asvetliakov.vscode-neovim"
vscode "aaron-bond.better-comments"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.vscode-pull-request-github"

## Markdown"
vscode "bierner.github-markdown-preview"
vscode "yzhang.markdown-all-in-one"

## Kubernetes"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "Kubeshop.monokle"

## Go"
vscode "golang.go"

## Ruby"
vscode "Shopify.ruby-extensions-pack"
vscode "misogi.ruby-rubocop"

## YAML"
vscode "redhat.vscode-yaml"

## Terraform"
vscode "hashicorp.terraform"
