{
  "catppuccin": { "branch": "main" },
  "diffview.nvim": { "branch": "main" },
  "fzf.vim": { "branch": "master" },
  "goyo.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "vim-cool": { "branch": "master" },
  "vim-helm": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-peekaboo": { "branch": "master" }
}
